1. Write a Python function to detect outliers in a dataset using the IQR method.

In [2]:
import pandas as pd
df=pd.read_csv("students_age.csv")

In [3]:
df.describe()

             age
count  20.000000
mean   14.650000
std     3.199918
min     8.000000
25%    13.750000
50%    14.000000
75%    16.000000
max    22.000000

In [4]:
Q1=df.age.quantile(0.25)
Q3=df.age.quantile(0.75)
Q1, Q3

(np.float64(13.75), np.float64(16.0))

In [5]:
IQR= Q3-Q1
IQR

np.float64(2.25)

In [ ]:
Q1=df.age.quantile(0.25)
Q3=df.age.quantile(0.75)

lower_limit = Q1-1.5*IQR
upper_limit = Q3+1.5*IQR

lower_limit, upper_limit

(np.float64(10.375), np.float64(19.375))

In [10]:
# Selecting Outliers
df[(df.age < lower_limit)|
   (df.age > upper_limit)]

           student_name  age
1         Tricia Flores    8
8            Brent Hall   20
12  Michelle Stephenson   10
17       Sarah Mcdowell   22

In [11]:
# Final data after removing outliers
df_final= df[(df.age > lower_limit)&(df.age < upper_limit)]
df_final

       student_name  age
0     Diana Lambert   14
2     Kathleen Long   14
3     Gerald Medina   16
4     Cynthia Myers   14
5        Paul Young   16
6      Allison Lane   14
7       John Rivers   15
9    Brandon Butler   18
10  Natalie Schmidt   13
11     Amanda Ellis   14
13   Deborah Barnes   16
14      Eric Newman   14
15    Teresa Morris   11
16      Carla Scott   16
18      Wanda Russo   16
19       Mark Scott   12

2. You have two DataFrames: clicks and installs. Merge them and calculate the install-to-click ratio per campaign.

In [54]:
cliks=pd.read_csv("clicks.csv")
install= pd.read_csv("installs.csv")

cliks.sort_values(by="campaign_id")

   campaign_id click_id  user_id           click_time
99    CAMP1001   CLK100     1044  2023-01-05 03:00:00
38    CAMP1001    CLK39     1010  2023-01-02 14:00:00
31    CAMP1001    CLK32     1070  2023-01-02 07:00:00
30    CAMP1001    CLK31     1088  2023-01-02 06:00:00
57    CAMP1001    CLK58     1036  2023-01-03 09:00:00
..         ...      ...      ...                  ...
28    CAMP1004    CLK29     1044  2023-01-02 04:00:00
76    CAMP1004    CLK77     1089  2023-01-04 04:00:00
77    CAMP1004    CLK78     1041  2023-01-04 05:00:00
18    CAMP1004    CLK19     1079  2023-01-01 18:00:00
68    CAMP1004    CLK69     1000  2023-01-03 20:00:00

[100 rows x 4 columns]

In [61]:
install.click_id.nunique()

60

In [52]:
merged=pd.merge(cliks, install, how='left', on='click_id', suffixes=('_click', '_install'))

In [53]:
merged

,campaign_id_click,click_id,user_id_click,click_time,campaign_id_install,user_id_install,install_time
0,CAMP1003,CLK1,1062,2023-01-01 00:00:00,NaN,NaN,NaN
1,CAMP1004,CLK2,1017,2023-01-01 01:00:00,NaN,NaN,NaN
2,CAMP1001,CLK3,1089,2023-01-01 02:00:00,NaN,NaN,NaN
3,CAMP1003,CLK4,1043,2023-01-01 03:00:00,CAMP1003,1043.0,1/1/2023 17:00
4,CAMP1003,CLK5,1033,2023-01-01 04:00:00,CAMP1003,1033.0,1/2/2023 21:00
...,...,...,...,...,...,...,...
95,CAMP1002,CLK96,1085,2023-01-04 23:00:00,CAMP1002,1085.0,1/6/2023 13:00
96,CAMP1002,CLK97,1027,2023-01-05 00:00:00,NaN,NaN,NaN
97,CAMP1004,CLK98,1065,2023-01-05 01:00:00,CAMP1004,1065.0,1/5/2023 21:00
98,CAMP1002,CLK99,1041,2023-01-05 02:00:00,CAMP1002,1041.0,1/6/2023 23:00
99,CAMP1001,CLK100,1044,2023-01-05 03:00:00,NaN,NaN,NaN

3. How would you use Python to automate a weekly reporting task that includes querying data, generating a chart, and emailing it?